backend/controllers/MenuController.php

    public function actionCreate()
    {
        $model = new Menu();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `menu` (`name`, `url`, `icon`, `show`, `order`, `menu_id`) VALUES ('Developer', '#', 'icon-arrow-left', 1, 2, NULL)

    protected function findModel($id)
    {
        if (( $model = Menu::findOne($id) ) !== null) {
---
SELECT * FROM `menu` WHERE `id`='1'