common/components/TranslationEventHandler.php

    public static function handleMissingTranslation(MissingTranslationEvent $event) {

        $source_message = SourceMessage::findOne(['category' => $event->category, 'message' => $event->message]);

        if($source_message === null){
            $source_message = new SourceMessage();
            $source_message->category = $event->category;
            $source_message->message = $event->message;
            $source_message->save();
        }

        $message = Message::findOne(['id' => $source_message->id, 'language' => $event->language]);

        if($message === null){
            $message = new Message();
            $message->id = $source_message->id;
            $message->language = $event->language;
            $message->translation = $source_message->message;
            $message->save();
---
SELECT * FROM `source_message` WHERE (`category`='back') AND (`message`='Update {modelClass}: ')
INSERT INTO `source_message` (`category`, `message`) VALUES ('back', 'Update {modelClass}: ')
SELECT * FROM `message` WHERE (`id`=24) AND (`language`='en-US')
INSERT INTO `message` (`id`, `language`, `translation`) VALUES (24, 'en-US', 'Update {modelClass}: ')