backend/models/Menu.php

    public static function buildMenu($parentId = null)
    {
        $menu = [];

        if (is_null($parentId)) {
            $where = 'menu_id IS NULL';
            array_push($menu, [
                'label' => Yii::t("back", "Dashboard"),
                'url' => Yii::$app->homeUrl,
                'visible' => true,
                'active' => Yii::$app->controller->id == 'site' ? true : false,
                'template' => self::buildTemplate("fa-dashboard", false),
                'submenuTemplate' => self::SUBMENU_TEMPLATE
            ]);
        } else {
            $where = 'menu_id = :menu_id';
        }

        $children = self::find()
            ->where($where, is_null($parentId) ? [] : [':menu_id' => $parentId])
            ->orderBy('order ASC')
            ->all();
---
SELECT * FROM `menu` WHERE menu_id IS NULL ORDER BY `order`


            //Buscamos activos, si los hay, se activa el padre
            if (count($child->menus) > 0) {
                $active = self::findActiveChild($child->menus);
---
SELECT * FROM `menu` WHERE `menu_id`=1